"""
Пользователь вводит данные о количестве предприятий, их наименования и прибыль за 4 квартал (т.е. 4 числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий) и отдельно вывести наименования предприятий,
чья прибыль выше среднего и ниже среднего.
"""

from collections import defaultdict

quan = int(input("Введите количество предприятий, которые будут заполнятся: "))
defdict = defaultdict(int)
print(defdict)
